{
  "entries": [
    {
      "title": "Bot Introduction",
      "content": "The bot is a radio bot called Pissle radio. You can use it by doing ``/radio continent:[] country:[] action:[]`` to select a radio station. After selecting a station, you can play a song using the bot.\n\n- Example: ``/radio continent:North America country:United States action:98.7 The Shark``\n\nTo control the server volume for the bot, you can use the ``/volume`` command. The command allows you to adjust the volume level.\n\nIf you need help with command usage, you can use the ``/help`` command. It provides information and usage instructions for various commands.\n\nTo quickly mute and unmute the bot, you can use the ``/mute`` command.\n\nIf you have any suggestions for the bot, you can use the ``/suggest`` command to send your suggestions to the bot creators.\n\nTo view wikis about various topics, you can use the ``/wiki`` command. It provides access to information and articles on different subjects.\n\nFor detailed information about the bot, including resource usage, developer details, and more, you can use the ``/botinfo`` command."
    },
    {
      "title": "Radio Station Sources",
      "content": "We are currently in talks with Radio Garden (https://radio.garden/) and Global.com (https://global.com/) to secure access to their stream links and resources. These collaborations would enable us to offer enhanced features such as next playing information, artist details, and more, if approved and coordinated with by the respective platforms.\n\nIn addition, we have permission and access to use some user-hosted and provided stream links. These stream links are contributed by our users and allow us to expand our selection of available radio stations."
    },
    {
      "title": "Buffering/Freezing Audio",
      "content": "If you're experiencing buffering or freezing audio when streaming radio stations, it's important to consider that radio streams are often transmitted from various parts of the world. The geographical distance between you and the server hosting the radio stream can introduce latency and cause buffering issues.\n\nLatency, or the time it takes for data to travel between your device and the server, can lead to interruptions in playback. As the audio data needs to be transmitted in real-time, any delays in data reaching your device can result in buffering.\n\n**Somethings you can do:**\n- 1.) Raise the bitrate quility in your discord voice channel to something higher \n- 2.) Choose another stations\n- 3.) Report the defective station to the bot developer, you can use ``/report`` to report the issue/bug\n\nUnfortunately, there might not be much you can do to completely eliminate buffering caused by latency, as it's a fundamental constraint of network communication. Some level of buffering might still occur due to the nature of streaming audio content over the internet. It's a trade-off between ensuring a smooth playback experience and the limitations of the network infrastructure."
    }    
  ]
}
